index=* host=* sysmon
| rex field=_raw "(?s)<EventID>(?<EventID>\d+)</EventID>"
| rex field=_raw "(?s)<Data Name=\"Image\">(?<Image>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"CommandLine\">(?<CommandLine>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"ParentImage\">(?<ParentImage>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"ParentCommandLine\">(?<ParentCommandLine>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"User\">(?<User>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"ParentUser\">(?<ParentUser>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"CurrentDirectory\">(?<CurrentDirectory>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"RuleName\">(?<RuleName>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"Company\">(?<Company>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"OriginalFileName\">(?<OriginalFileName>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"Protocol\">(?<Protocol>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"SourceIp\">(?<SourceIp>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"SourceHostname\">(?<SourceHostname>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"SourcePort\">(?<SourcePort>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"DestinationIp\">(?<DestinationIp>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"DestinationHostname\">(?<DestinationHostname>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"DestinationPort\">(?<DestinationPort>[^<]*)</Data>"
| table EventID Image CommandLine ParentImage ParentCommandLine User ParentUser CurrentDirectory RuleName Company OriginalFileName Protocol SourceIp SourceHostname SourcePort DestinationIp DestinationHostname DestinationPort | sort _time
