index=* host=* Linux-Sysmon 
| rex field=_raw "(?s)<EventID>(?<EventID>\d+)</EventID>"
| rex field=_raw "(?s)<Data Name=\"Image\">(?<Image>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"CommandLine\">(?<CommandLine>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"ParentImage\">(?<ParentImage>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"ParentCommandLine\">(?<ParentCommandLine>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"User\">(?<User>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"ParentUser\">(?<ParentUser>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"CurrentDirectory\">(?<CurrentDirectory>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"RuleName\">(?<RuleName>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"Company\">(?<Company>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"OriginalFileName\">(?<OriginalFileName>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"Protocol\">(?<Protocol>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"SourceIp\">(?<SourceIp>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"SourceHostname\">(?<SourceHostname>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"SourcePort\">(?<SourcePort>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"DestinationIp\">(?<DestinationIp>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"DestinationHostname\">(?<DestinationHostname>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"DestinationPort\">(?<DestinationPort>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"TargetFilename\">(?<TargetFilename>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"State\">(?<State>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"Version\">(?<Version>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"Configuration\">(?<Configuration>[^<]*)</Data>"
| rex field=_raw "(?s)<Data Name=\"SchemaVersion\">(?<SchemaVersion>[^<]*)</Data>"
| eval ConnectionInfo = SourceIp . ":" . SourcePort . " (" . SourceHostname . ") -> " . DestinationIp . ":" . DestinationPort . " (" . DestinationHostname . ") via " . Protocol
| strcat allrequired=f ConnectionInfo TargetFilename Configuration State " " Version " " SchemaVersion combo
| table _time EventID host combo Image CommandLine ParentImage ParentCommandLine User ParentUser CurrentDirectory Company OriginalFileName RuleName | sort _time
